Core/src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.СлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТариф</name>
    <type>
      <types>CatalogRef.ЗоныТарифыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтгрузки</name>
    <type>
      <types>EnumRef.СпособыОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходнаяНакладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/СпособыОтгрузки/СпособыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОтгрузки</name>
  <enumValues>
    <name>ПередатьКурьеруСлужбыДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПередатьКурьеруЕдиногоСклада</name>
  </enumValues>
  <enumValues>
    <name>СамостоятельноПривезтиНаЕдиныйСклад</name>
  </enumValues>
  <enumValues>
    <name>СамостоятельноПривезтиНаСкладСлужбыДоставки</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ПунктВыдачи</name>
  </enumValues>
  <enumValues>
    <name>Курьер</name>
  </enumValues>
  <enumValues>
    <name>Почта</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/СлужбыДоставки/СлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СлужбыДоставки</name>
  <predefined>
    <items>
      <name>ДоставкаСобственнымиСилами</name>
      <description>Доставка собственными силами</description>
    </items>
  </predefined>
  <attributes>
    <name>ФормулаСтоимости</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаСебестоимости</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУчета</name>
    <type>
      <types>EnumRef.ВариантыУчетаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЯндекса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенСамопривозНаЕдиныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенЗаборНаЕдиныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенСамопривозНаСкладСлужбыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможенЗаборНаСкладСлужбыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРасчетов</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыРасчетовДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСпособыДоставки</name>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСпособыОтгрузки</name>
    <attributes>
      <name>СпособОтгрузки</name>
      <type>
        <types>EnumRef.СпособыОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ВидыЗаказовПокупателей/ВидыЗаказовПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаказовПокупателей</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДоставлен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОтгружен</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОжидаетОтгрузки</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьДоставку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСостояний</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияЗаказовПокупателей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/СтруктурныеЕдиницы/СтруктурныеЕдиницы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктурныеЕдиницы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОсновноеПодразделение</name>
      <description>Основное подразделение</description>
    </items>
    <items>
      <name>ОсновнойСклад</name>
      <description>Основной склад</description>
    </items>
    <items>
      <name>ТранзитныйСклад</name>
      <description>ტრანზიტული საწყობი</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипСтруктурнойЕдиницы</name>
    <type>
      <types>EnumRef.ТипыСтруктурныхЕдиниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрдерныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМОЛ</name>
    <comment>Подпись материально-ответственного лица</comment>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРознице</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценки</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПеремещения</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПеремещения</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтходов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяОтходов</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяСписанияНаРасходы</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяПередачиВЭксплуатацию</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаИсточникаВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучателяВозвратаИзЭксплуатации</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВРозницеРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНаценкиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзитныйСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Documents/МаршрутныйЛист/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	ПредставленияДокументов = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	УстановитьУсловноеОформление();
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НесколькоОрганизаций", ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") 
	И НЕ ЗначениеЗаполнено(Константы.Компания.Получить())); 
	СтруктураПараметров.Вставить("НесколькоСкладов", ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам"));
	СтруктураПараметров.Вставить("НесколькоВидовЗаказов", ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей"));
	СтруктураПараметров.Вставить("ТребуетсяНастройка", ТребуетсяНастройка(СтруктураПараметров.НесколькоВидовЗаказов));
	СтруктураПараметров.Вставить("НеПредупреждатьПередФормированием", ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить("МаршрутныйЛист", "НеПредупреждатьПередФормированием", Ложь));
	ФормаПараметры = Новый ФиксированнаяСтруктура(СтруктураПараметров);
	
	ОбновитьАдресОтправкиНаФорме();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВариантДоставки = "Курьер";
		Объект.СлужбаДоставки = Справочники.СлужбыДоставки.ДоставкаСобственнымиСилами;
		Если ЗначениеЗаполнено(Объект.Склад) Тогда
			ЗаполнитьДанныеСклада();
		КонецЕсли; 
	Иначе
		Если ЗначениеЗаполнено(Объект.СлужбаДоставки) И НЕ Объект.СлужбаДоставки=Справочники.СлужбыДоставки.ДоставкаСобственнымиСилами Тогда
			ВариантДоставки = "СлужбаДоставки";
		Иначе
			ВариантДоставки = "Курьер";
			Если НЕ ЗначениеЗаполнено(Объект.СлужбаДоставки) Тогда
				Объект.СлужбаДоставки = Справочники.СлужбыДоставки.ДоставкаСобственнымиСилами;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	ОтображатьПодсказки = ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить(Объект.Ссылка.Метаданные().Имя, "ОтображатьПодсказки", Истина);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	КомандыПечати = ПолучитьИзВременногоХранилища(Команды.Найти("АдресКомандПечатиВоВременномХранилище").Действие);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Идентификатор", "МаршрутныйЛист");
	Строки = КомандыПечати.НайтиСтроки(СтруктураОтбора);
	Если Строки.Количество()=0 Тогда
		ИмяКомандыПечатиМаршрутныйЛист = "";
	Иначе
		ИмяКомандыПечатиМаршрутныйЛист = Строки[0].ИмяКомандыНаФорме;
	КонецЕсли;
	ЗаполнитьКомандыПечатиПоМассивуОбъектов(КомандыПечати);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ЗаполнитьИУстановитьВидимостьНастройкиСостоянийЗаказов();
	
	ЗаполнитьФильтры();
	ЗаполнитьЗаказы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовокФильтров();
	
	Если ФормаПараметры.ТребуетсяНастройка Тогда
		#Если ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ПриОткрытииЗадержка", 1, Истина);	
		#Иначе
		ПодключитьОбработчикОжидания("ПриОткрытииЗадержка", 0.1, Истина);	
		#КонецЕсли 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗадержка()
	
	Если ФормаПараметры.НесколькоВидовЗаказов Тогда
		ПодсказкаНастройки = НСтр("ka='Укажите фиксированные состояния для разных видов заказов. Данные требуются для корректной работы механизма доставки';ru='Укажите фиксированные состояния для разных видов заказов. Данные требуются для корректной работы механизма доставки'");
	Иначе
		ПодсказкаНастройки = НСтр("ka='Укажите фиксированные состояния заказов. Данные требуются для корректной работы механизма доставки';ru='Укажите фиксированные состояния заказов. Данные требуются для корректной работы механизма доставки'");
	КонецЕсли; 
	ОткрытьФормуНастройкиСостояний(
	НСтр("ka='Состояния доставки заказов';ru='Состояния доставки заказов'"),
	ПодсказкаНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ФормаПараметры.НесколькоВидовЗаказов Тогда
		ВидЗаказаОбъект = Справочники.ВидыЗаказовПокупателей.Основной.ПолучитьОбъект();
		Если Элементы.НовоеСостояниеЗаказов.Доступность И ЗначениеЗаполнено(НовоеСостояниеЗаказов) Тогда
			ВидЗаказаОбъект.СостояниеОтгружен = НовоеСостояниеЗаказов;
		КонецЕсли;
		Если Элементы.СостояниеЗаказов.Доступность И ЗначениеЗаполнено(СостояниеЗаказов) Тогда
			ВидЗаказаОбъект.СостояниеОжидаетОтгрузки = СостояниеЗаказов;
		КонецЕсли;
		ВидЗаказаОбъект.Записать();
	КонецЕсли; 
	
	НовыеЗаказы = Новый Массив;
	Для Каждого СтрокаТабличнойЧасти Из Заказы Цикл
		Если НЕ СтрокаТабличнойЧасти.ПринятьВРаботу Тогда
			Продолжить;
		КонецЕсли; 
		НовыеЗаказы.Добавить(СтрокаТабличнойЧасти.Заказ);
	КонецЦикла;
	
	// Удаление старых строк
	СтрокиКУдалению = Новый Массив;
	Для каждого СтрокаТабличнойЧасти Из ТекущийОбъект.Заказы Цикл
		Если НовыеЗаказы.Найти(СтрокаТабличнойЧасти.Заказ)=Неопределено Тогда
			СтрокиКУдалению.Добавить(СтрокаТабличнойЧасти);
		КонецЕсли; 
	КонецЦикла;
	Для каждого СтрокаТабличнойЧасти Из СтрокиКУдалению Цикл
		НовоеСостояние = СостояниеОжидаетОтгрузки(СтрокаТабличнойЧасти.Заказ, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли; 
		УстановитьСостояниеЗаказа(СтрокаТабличнойЧасти.Заказ, НовоеСостояние);
		ТекущийОбъект.Заказы.Удалить(СтрокаТабличнойЧасти);
	КонецЦикла; 
	
	// Добавление новых заказов в табличную часть
	Для каждого Заказ Из НовыеЗаказы Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Заказ", Заказ);
		Строки = ТекущийОбъект.Заказы.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество()=0 Тогда
			НоваяСтрока = ТекущийОбъект.Заказы.Добавить();
			НоваяСтрока.Заказ = Заказ;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="Запись_НаборКонстант" Тогда
		ЗаполнитьИУстановитьВидимостьНастройкиСостоянийЗаказов();
	ИначеЕсли ИмяСобытия="Запись_Склад" И Параметр=Объект.Склад Тогда
		ЗаполнитьДанныеСклада();
	ИначеЕсли ИмяСобытия="ИзмененыФиксированныеСостоянияЗаказов" Тогда
		Если Параметр="НеНастроено" Тогда
			#Если ВебКлиент Тогда
			ТолькоПросмотр = Истина;
			ПодключитьОбработчикОжидания("ЗакрытьСЗадержкой", 0.1, Истина);	
			#Иначе
			Закрыть();
			#КонецЕсли 
			Возврат;
		Иначе
			ПриИзмененииФиксированныхСостояний(Параметр);
		КонецЕсли; 
	ИначеЕсли ИмяСобытия="Запись_ВидыЗаказовПокупателей" Тогда
		ЗаполнитьЗаказы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСЗадержкой()
	
	Закрыть();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
Процедура ВариантДоставкиПриИзменении(Элемент)
	
	СобственнаяДоставка = (ВариантДоставки="Курьер");
	
	Если СобственнаяДоставка Тогда
		Если ЗначениеЗаполнено(Объект.АдресОтправки) Тогда
			Объект.АдресОтправки = "";
			Объект.АдресОтправкиЗначенияПолей = "";
		КонецЕсли; 
		Если Объект.СлужбаДоставки<>ПредопределенноеЗначение("Справочник.СлужбыДоставки.ДоставкаСобственнымиСилами") Тогда
			Объект.СлужбаДоставки = ПредопределенноеЗначение("Справочник.СлужбыДоставки.ДоставкаСобственнымиСилами");
			ФильтрСлужбаДоставки = Объект.СлужбаДоставки;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Объект.СпособОтгрузки) Тогда
			Объект.СпособОтгрузки = Неопределено;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Объект.Склад) Тогда
			Объект.Склад = Неопределено;
			ФильтрСклад = Объект.Склад;
		КонецЕсли; 
	Иначе
		Если Объект.СлужбаДоставки=ПредопределенноеЗначение("Справочник.СлужбыДоставки.ДоставкаСобственнымиСилами") Тогда
			Объект.СлужбаДоставки = ПредопределенноеЗначение("Справочник.СлужбыДоставки.ПустаяСсылка");
			ФильтрСлужбаДоставки = Объект.СлужбаДоставки;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(Объект.СпособОтгрузки) Тогда
			Объект.СпособОтгрузки = ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаСкладСлужбыДоставки");
		КонецЕсли;
		ПередачаНаСкладКК = (Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаЕдиныйСклад") 
			ИЛИ Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаСкладСлужбыДоставки"));
		Если ЗначениеЗаполнено(Объект.Автомобиль) И НЕ ПередачаНаСкладКК Тогда
			Объект.Автомобиль = Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	ЗаполнитьЗаказы();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОтгрузкиПриИзменении(Элемент)
	
	ПередачаКурьеромКК = (Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.ПередатьКурьеруЕдиногоСклада") 
		ИЛИ Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.ПередатьКурьеруСлужбыДоставки"));
	ПередачаНаСкладКК = (Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаЕдиныйСклад") 
		ИЛИ Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаСкладСлужбыДоставки"));
		
	Если ПередачаКурьеромКК Тогда
		Если ЗначениеЗаполнено(Объект.Курьер) Тогда
			Объект.Курьер = Неопределено;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Объект.Автомобиль) Тогда
			Объект.Автомобиль = Неопределено;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
			ЗаполнитьДанныеСклада();
		КонецЕсли; 
	ИначеЕсли ПередачаНаСкладКК Тогда
		Если ЗначениеЗаполнено(Объект.Склад) Тогда
			Объект.Склад = Неопределено;
			ФильтрСклад = Объект.Склад;
		КонецЕсли; 
		Если ЗначениеЗаполнено(Объект.АдресОтправки) Тогда
			Объект.АдресОтправки = "";
			Объект.АдресОтправкиЗначенияПолей = "";
		КонецЕсли; 
	КонецЕсли; 
	
	ЗаполнитьЗаказы();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура СлужбаДоставкиПриИзменении(Элемент)
	
	ФильтрСлужбаДоставки = Объект.СлужбаДоставки;
	ЗаполнитьЗаказы();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура КурьерПриИзменении(Элемент)
	
	ФильтрКурьер = Объект.Курьер;
	ЗаполнитьЗаказы();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ФормаПараметры.НесколькоОрганизаций Тогда
		ФильтрОрганизация = Объект.Организация;
	КонецЕсли; 
	ЗаполнитьЗаказы();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если ФормаПараметры.НесколькоСкладов Тогда
		ФильтрСклад = Объект.Склад;
	КонецЕсли; 
	СкладПриИзмененииСервер();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер()
	
	ЗаполнитьДанныеСклада();
	ЗаполнитьЗаказы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	
	ЗаполнитьЗаказы();
	ОбновитьЗаголовокФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаказовРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиСостояний(
	НСтр("ka='Состояния доступных к отгрузке заказов';ru='Состояния доступных к отгрузке заказов'"),
	НСтр("ka='Укажите состояние заказов, которые будут заполняться в маршрутный лист';ru='Укажите состояние заказов, которые будут заполняться в маршрутный лист'"),
	"СостояниеОжидаетОтгрузки");
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеСостояниеЗаказовРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастройкиСостояний(
	НСтр("ka='Состояния отгруженных заказов';ru='Состояния отгруженных заказов'"),
	НСтр("ka='Укажите состояние, в которое будут переведены заказы покупателя после проведения маршрутного листа';ru='Укажите состояние, в которое будут переведены заказы покупателя после проведения маршрутного листа'"),
	"СостояниеОтгружен");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
	Если Поле=Элементы.ЗаказыПредставлениеЗаказа И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Заказ) Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("Ключ", СтрокаТабличнойЧасти.Заказ);
		СтруктураОткрытия.Вставить("Страница", "СтраницаДоставка");
		ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", СтруктураОткрытия);
	ИначеЕсли Поле=Элементы.ЗаказыПредставлениеРасходнойНакладной И ЗначениеЗаполнено(СтрокаТабличнойЧасти.РасходнаяНакладная) Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОткрытия = Новый Структура;
		СтруктураОткрытия.Вставить("Ключ", СтрокаТабличнойЧасти.РасходнаяНакладная);
		СтруктураОткрытия.Вставить("Страница", "ГруппаДоставка");
		ОткрытьФорму("Документ.РасходнаяНакладная.ФормаОбъекта", СтруктураОткрытия);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПринятьВРаботуПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	ОбновитьОбъемИВес(Заказы, ВесВсего, ОбъемВсего);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьДокументыОтгрузки(Команда)
	
	ПараметрыСовета = Новый Структура;
	ПараметрыСовета.Вставить("Заголовок", НСтр("ka='Формирование документов отгрузки';ru='Формирование документов отгрузки'"));
	ПараметрыСовета.Вставить("ТекстСообщения", НСтр("ka='Сейчас будут сформированы расходные накладные по всем заказам из маршрутного листа (если они еще не были созданы). Отгрузка будет произведена со склада, указанного в заказе.';ru='Сейчас будут сформированы расходные накладные по всем заказам из маршрутного листа (если они еще не были созданы). Отгрузка будет произведена со склада, указанного в заказе.'"));
	ПараметрыСовета.Вставить("ВидимостьБольшеНеПоказывать", Истина);
	ПараметрыСовета.Вставить("ЗаголовокКнопкиОк", НСтр("ka='გაგრძელება';ru='Продолжить'"));
	Если ФормаПараметры.НеПредупреждатьПередФормированием Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("БольшеНеПоказывать", ФормаПараметры.НеПредупреждатьПередФормированием);
		СтруктураВозврата.Вставить("КодВозврата", КодВозвратаДиалога.ОК);
		СформироватьДокументыОтгрузкиПродолжение(СтруктураВозврата, ПараметрыСовета);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("СформироватьДокументыОтгрузкиПродолжение", ЭтотОбъект, ПараметрыСовета);
		ОткрытьФорму("ОбщаяФорма.ФормаПредупреждения", ПараметрыСовета, ЭтаФорма, Истина, , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыОтгрузкиПродолжение(Результат, ПараметрыСовета) Экспорт
	
	Если ТипЗнч(Результат)<>Тип("Структура") ИЛИ НЕ Результат.Свойство("КодВозврата") ИЛИ Результат.КодВозврата<>КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
		Записать(ПараметрыЗаписи);
	КонецЕсли; 
	
	ЗапуститьФоновоеЗадание();
	
	Если Результат.БольшеНеПоказывать<>ФормаПараметры.НеПредупреждатьПередФормированием Тогда
		СохранитьНастройкуНеПредупреждатьПередФормированием(Результат.БольшеНеПоказывать);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНеПредупреждатьПередФормированием(БольшеНеПоказывать)
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("МаршрутныйЛист", "НеПредупреждатьПередФормированием", БольшеНеПоказывать);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	ОтметитьЗаказы(Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	ОтметитьЗаказы(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьЗаказы();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьНовоеСостояниеЗаказов(Команда)
	
	ОткрытьФормуНастройкиСостояний(
	НСтр("ka='Состояния отгруженных заказов';ru='Состояния отгруженных заказов'"),
	НСтр("ka='Укажите состояния, в которые будут переведены заказы покупателя после проведения маршрутного листа';ru='Укажите состояния, в которые будут переведены заказы покупателя после проведения маршрутного листа'"),
	"СостояниеОтгружен");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСостояниеЗаказов(Команда)
	
	ОткрытьФормуНастройкиСостояний(
	НСтр("ka='Состояния доступных к отгрузке заказов';ru='Состояния доступных к отгрузке заказов'"),
	НСтр("ka='Укажите состояния для разных видов заказов, которые будут заполняться в маршрутный лист';ru='Укажите состояния для разных видов заказов, которые будут заполняться в маршрутный лист'"),
	"СостояниеОжидаетОтгрузки");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчитатьсяОДоставке(Команда)
	
	СтруктураОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураОткрытия.Вставить("МаршрутныйЛист", Объект.Ссылка);
	КонецЕсли; 
	ОткрытьФорму("Обработка.ФормированиеДокументовДоставки.Форма", СтруктураОткрытия, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти 

#Область ФоновоеЗаданиеПолучениеДанных

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание()
	
	УстановитьДоступностьФормы(Ложь);
	
	Задание = ЗаданиеФормированиеДокументовОтгрузки();
	Если Задание=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессФормированияДокументов", ЭтотОбъект); 
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
	Задание,
	Новый ОписаниеОповещения("ОбработатьФормированиеДокументов", ЭтотОбъект),
	ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессФормированияДокументов(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Прогресс.Статус <> "Выполняется" ИЛИ Прогресс.Прогресс=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИндикаторВыполнения = Прогресс.Прогресс.Процент;
	ДлительнаяОперацияДокумент = Прогресс.Прогресс.Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФормированиеДокументов(Результат, Параметры) Экспорт
	
	УстановитьДоступностьФормы(Истина);
	
	Если Результат.Статус <> "Выполнено" Тогда
		Если Результат.Свойство("КраткоеПредставлениеОшибки") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Результат.КраткоеПредставлениеОшибки);
		КонецЕсли; 
		Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если ТипЗнч(РезультатВыполнения)=Тип("Структура") И РезультатВыполнения.Свойство("Ошибки") И ТипЗнч(РезультатВыполнения.Ошибки)=Тип("СписокЗначений") И РезультатВыполнения.Ошибки.Количество()>0 Тогда
		Для каждого Ошибка Из РезультатВыполнения.Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Ошибка.Представление,
			Ошибка.Значение);
		КонецЦикла;
		Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
		Возврат;
	КонецЕсли;
	
	ОбработатьФормированиеДокументовСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьФормированиеДокументовСервер()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыСтатусФоновогоЗадания", "Видимость", Ложь);
	
	Прочитать();
	ЗаполнитьЗаказы();
	
КонецПроцедуры
 
&НаСервере
Функция ЗаданиеФормированиеДокументовОтгрузки()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыСтатусФоновогоЗадания", "Видимость", Истина);
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	ДлительнаяОперацияДокумент = "";
	ИндикаторВыполнения = 0;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("МаршрутныйЛист", Объект.Ссылка);
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"Документы.МаршрутныйЛист.ВыполнитьОтгрузку",
	ПараметрыЗадания,
	ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьФормы(Доступность)
	
	ТолькоПросмотр = НЕ Доступность;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВариантДоставки", "ТолькоПросмотр", НЕ Доступность);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаказыКоманды", "Доступность", Доступность);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Заказы", "ТолькоПросмотр", НЕ Доступность);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Инструкция = СтандартныеПодсистемыСервер.ИнструкцияУсловногоОформления();
	Инструкция.Поля = "ЗаказыПринятьВРаботу";
	Инструкция.Отборы.Вставить("Заказы.Отгружен", Истина);
	Инструкция.Отборы.Вставить("Заказы.Сохранен", Истина);
	Инструкция.Оформление.Вставить("ТолькоПросмотр", Истина);
	СтандартныеПодсистемыСервер.ДобавитьЭлементУсловногоОформления(ЭтаФорма, Инструкция);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	ФормаПараметры = Форма.ФормаПараметры;
	
	СобственнаяДоставка = (Форма.ВариантДоставки="Курьер");
	ПередачаКурьеромКК = (Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.ПередатьКурьеруЕдиногоСклада") 
		ИЛИ Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.ПередатьКурьеруСлужбыДоставки"));
	ПередачаНаСкладКК = (Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаЕдиныйСклад") 
		ИЛИ Объект.СпособОтгрузки=ПредопределенноеЗначение("Перечисление.СпособыОтгрузки.СамостоятельноПривезтиНаСкладСлужбыДоставки"));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СлужбаДоставки", "Видимость", НЕ СобственнаяДоставка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособОтгрузки", "Видимость", НЕ СобственнаяДоставка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Склад", "Видимость", НЕ СобственнаяДоставка И ПередачаКурьеромКК И Форма.ФормаПараметры.НесколькоСкладов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "АдресОтправки", "Видимость", НЕ СобственнаяДоставка И ПередачаКурьеромКК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Курьер", "Видимость", СобственнаяДоставка ИЛИ ПередачаНаСкладКК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Автомобиль", "Видимость", СобственнаяДоставка ИЛИ ПередачаНаСкладКК);
	
	ЕстьНеотгруженные = Ложь;
	ЕстьРасходные = Ложь;
	ЕстьНесохраненные = Ложь;
	РасходныеОтображены = Ложь;
	Для каждого СтрокаТабличнойЧасти Из Форма.Заказы Цикл
		Если СтрокаТабличнойЧасти.ПринятьВРаботу И НЕ СтрокаТабличнойЧасти.Отгружен Тогда
			ЕстьНеотгруженные = Истина;
		КонецЕсли;
		Если СтрокаТабличнойЧасти.Отгружен Тогда
			ЕстьРасходные = Истина;
		КонецЕсли; 
		Если НЕ СтрокаТабличнойЧасти.Сохранен Тогда
			ЕстьНесохраненные = Истина;
		КонецЕсли;
		Если НЕ ПустаяСтрока(СтрокаТабличнойЧасти.ПредставлениеРасходнойНакладной) Тогда
			РасходныеОтображены = Истина;
		КонецЕсли; 
	КонецЦикла; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СформироватьДокументыОтгрузки", "Доступность", Объект.Проведен И ЕстьНеотгруженные);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтчитатьсяОДоставке", "Доступность", Объект.Проведен);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаказыГрупповойВыбор", "Доступность", ЕстьНеотгруженные ИЛИ ЕстьНесохраненные);
	Если НЕ ПустаяСтрока(Форма.ИмяКомандыПечатиМаршрутныйЛист) Тогда
		Для каждого Элемент Из Элементы.ПодменюПечать.ПодчиненныеЭлементы Цикл
			Если Элемент.Имя=Форма.ИмяКомандыПечатиМаршрутныйЛист Тогда
				Продолжить;
			КонецЕсли; 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, Элемент.Имя, "Доступность", ЕстьРасходные);
		КонецЦикла; 
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаказыПредставлениеРасходнойНакладной", "Видимость", РасходныеОтображены);
	
	// Видимость фильтров
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФильтрОрганизация", "Видимость", ФормаПараметры.НесколькоОрганизаций);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФильтрСклад", "Видимость", ФормаПараметры.НесколькоСкладов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФильтрВидЗаказа", "Видимость", ФормаПараметры.НесколькоВидовЗаказов);
	
	Если НЕ ФормаПараметры.НесколькоВидовЗаказов Тогда
		Форма.ФильтрВидЗаказа = ПредопределенноеЗначение("Справочник.ВидыЗаказовПокупателей.Основной");
	КонецЕсли; 
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
Функция ТребуетсяНастройка(НесколькоВидовЗаказов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыЗаказовПокупателей.Ссылка
	|ИЗ
	|	Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
	|ГДЕ
	|	(ВидыЗаказовПокупателей.СостояниеОжидаетОтгрузки = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка)
	|			ИЛИ ВидыЗаказовПокупателей.СостояниеОтгружен = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка))
	|	И НЕ ВидыЗаказовПокупателей.ПометкаУдаления И НЕ ВидыЗаказовПокупателей.НеИспользоватьДоставку";

	Если НЕ НесколькоВидовЗаказов Тогда
		Запрос.Текст = Запрос.Текст+"
		|	И ВидыЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыЗаказовПокупателей.Основной)";	
	КонецЕсли;
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастройкиСостояний(Заголовок, Подсказка, ИмяРеквизита = "")
	
	СтруктураОткрытия = Новый Структура;
	СтруктураОткрытия.Вставить("Заголовок", Заголовок);
	СтруктураОткрытия.Вставить("Подсказка", Подсказка);
	Если НЕ ПустаяСтрока(ИмяРеквизита) Тогда
		СтруктураОткрытия.Вставить("ИмяРеквизита", ИмяРеквизита);
	КонецЕсли; 
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиФиксированныхСостоянийЗаказов", СтруктураОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииФиксированныхСостояний(ИмяРеквизита)
	
	ЗаполнитьИУстановитьВидимостьНастройкиСостоянийЗаказов();
	Если ИмяРеквизита="СостояниеОжидаетОтгрузки" ИЛИ ПустаяСтрока(ИмяРеквизита) Тогда
		ЗаполнитьЗаказы();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОбъемИВес(Заказы, ВесВсего, ОбъемВсего)
	
	ОбъемВсего = 0;
	ВесВсего = 0;
	
	Для каждого СтрокаТабличнойЧасти Из Заказы Цикл
		Если НЕ СтрокаТабличнойЧасти.ПринятьВРаботу Тогда
			Продолжить;
		КонецЕсли; 
		ВесВсего = ВесВсего+СтрокаТабличнойЧасти.Вес;
		ОбъемВсего = ОбъемВсего+СтрокаТабличнойЧасти.Объем;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗаказы(Значение)
	
	Для Каждого СтрокаТабличнойЧасти Из Заказы Цикл
		Если СтрокаТабличнойЧасти.Отгружен Тогда
			Продолжить;
		КонецЕсли; 
		СтрокаТабличнойЧасти.ПринятьВРаботу = Значение;
	КонецЦикла;
	ОбновитьОбъемИВес(Заказы, ВесВсего, ОбъемВсего);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИУстановитьВидимостьНастройкиСостоянийЗаказов()
	
	Если НЕ ФормаПараметры.НесколькоВидовЗаказов Тогда
		
		СтруктураСостояний = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Справочники.ВидыЗаказовПокупателей.Основной, "СостояниеОжидаетОтгрузки, СостояниеОтгружен");
		
		СостояниеЗаказов = СтруктураСостояний.СостояниеОжидаетОтгрузки;
		Элементы.СостояниеЗаказов.Доступность = НЕ ЗначениеЗаполнено(СостояниеЗаказов);
		Элементы.СостояниеЗаказов.КнопкаОчистки = НЕ ЗначениеЗаполнено(СостояниеЗаказов);
		Элементы.СостояниеЗаказов.КнопкаВыпадающегоСписка = НЕ ЗначениеЗаполнено(СостояниеЗаказов);
		Если ЗначениеЗаполнено(СостояниеЗаказов) Тогда
			Элементы.СостояниеЗаказовРасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Маршрутный лист заполняется заказами с состоянием «%1». Настраивается ';ka='Маршрутный лист заполняется заказами с состоянием «%1». Настраивается '"), СостояниеЗаказов),
				Новый ФорматированнаяСтрока(НСтр("ka='აქ';ru='здесь'"),,,,"Переход"));
		Иначе
			Элементы.СостояниеЗаказовРасширеннаяПодсказка.Заголовок = "";	
		КонецЕсли;
		
		НовоеСостояниеЗаказов = СтруктураСостояний.СостояниеОтгружен;
		Элементы.НовоеСостояниеЗаказов.Доступность = НЕ ЗначениеЗаполнено(НовоеСостояниеЗаказов);
		Элементы.НовоеСостояниеЗаказов.КнопкаОчистки = НЕ ЗначениеЗаполнено(НовоеСостояниеЗаказов);
		Элементы.НовоеСостояниеЗаказов.КнопкаВыпадающегоСписка = НЕ ЗначениеЗаполнено(НовоеСостояниеЗаказов);
		Если ЗначениеЗаполнено(НовоеСостояниеЗаказов) Тогда
			Элементы.НовоеСостояниеЗаказовРасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
				Элементы.ДекорацияИконкаПодсказка.Подсказка+". ",
				Новый ФорматированнаяСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Состояние заказов изменится при проведении на «%1». Настраивается ';ka='Состояние заказов изменится при проведении на «%1». Настраивается '"), НовоеСостояниеЗаказов)),
				Новый ФорматированнаяСтрока(НСтр("ka='აქ';ru='здесь'"),,,,"Переход"));
		Иначе
			Элементы.НовоеСостояниеЗаказовРасширеннаяПодсказка.Заголовок = "";	
		КонецЕсли; 
			
	КонецЕсли; 
	
	ТолькоГотовыеКОтгрузке = Истина;
	Элементы.НовоеСостояниеЗаказов.Видимость = НЕ ФормаПараметры.НесколькоВидовЗаказов;
	Элементы.НастроитьНовоеСостояниеЗаказов.Видимость = ФормаПараметры.НесколькоВидовЗаказов;
	Элементы.СостояниеЗаказов.Видимость = НЕ ФормаПараметры.НесколькоВидовЗаказов;
	Элементы.ГруппаОтгруженныеЗаказы.Видимость = ФормаПараметры.НесколькоВидовЗаказов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАдресОтправкиНаФорме()
	
	Если ПустаяСтрока(Объект.АдресОтправки) Тогда
		Строки = Новый Массив;
		Строки.Добавить(НСтр("ru='Заполните фактический адрес в карточке ';ka='Заполните фактический адрес в карточке '"));
		Если ФормаПараметры.НесколькоСкладов Тогда
			Строки.Добавить(НСтр("ru='склада ';ka='склада '"));
			Строки.Добавить(Новый ФорматированнаяСтрока(Строка(Объект.Склад),,,, ПолучитьНавигационнуюСсылку(Объект.Склад)));
		Иначе
			Строки.Добавить(НСтр("ru='организации ';ka='организации '"));
			Строки.Добавить(Новый ФорматированнаяСтрока(Строка(Объект.Организация),,,, ПолучитьНавигационнуюСсылку(Объект.Организация)));
		КонецЕсли;
		АдресОтправки = Новый ФорматированнаяСтрока(Строки);
		Элементы.АдресОтправки.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
	Иначе
		АдресОтправки = Новый ФорматированнаяСтрока(Объект.АдресОтправки);
		Элементы.АдресОтправки.ЦветТекста = Новый Цвет;
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеЗаказа(Заказ, НовоеСостояние)
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	ЗаказОбъект.СостояниеЗаказа = НовоеСостояние;
	ЗаказОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФильтры()
	
	ФильтрСлужбаДоставки 	= Объект.СлужбаДоставки;
	ФильтрКурьер 			= Объект.Курьер;
	ФильтрСпособДоставки 	= Объект.СпособДоставки;
	Если ФормаПараметры.НесколькоОрганизаций Тогда
		ФильтрОрганизация 	= Объект.Организация;
	Иначе
		ФильтрОрганизация 	= Справочники.Организации.ПустаяСсылка();
	КонецЕсли; 
	Если ФормаПараметры.НесколькоСкладов Тогда
		ФильтрСклад 		= Объект.Склад;
	Иначе
		ФильтрСклад 		= Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказы(ПервоеЗаполнение = Ложь)
	
	МассивЗаказов = Новый Массив;
	МассивСохраненных = Новый Массив;
	Если ПервоеЗаполнение Тогда
		Для каждого СтрокаТабличнойЧасти Из Объект.Заказы Цикл
			МассивЗаказов.Добавить(СтрокаТабличнойЧасти.Заказ);
			МассивСохраненных.Добавить(СтрокаТабличнойЧасти.Заказ);
		КонецЦикла; 
	Иначе
		Для каждого СтрокаТабличнойЧасти Из Заказы Цикл
			Если СтрокаТабличнойЧасти.ПринятьВРаботу Тогда
				МассивЗаказов.Добавить(СтрокаТабличнойЧасти.Заказ);
			КонецЕсли; 
		КонецЦикла; 
		Для каждого СтрокаТабличнойЧасти Из Объект.Заказы Цикл
			МассивСохраненных.Добавить(СтрокаТабличнойЧасти.Заказ);
		КонецЦикла; 
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Заказы", МассивЗаказов);
	Запрос.УстановитьПараметр("ЗаказыСохраненные", МассивСохраненных);
	Запрос.УстановитьПараметр("ВидЗаказа", ФильтрВидЗаказа);
	Запрос.УстановитьПараметр("Организация", ФильтрОрганизация); 
	Запрос.УстановитьПараметр("ДатаДоставки", ФильтрДатаДоставки); 
	Запрос.УстановитьПараметр("СлужбаДоставки", ФильтрСлужбаДоставки); 
	Запрос.УстановитьПараметр("Курьер", ФильтрКурьер); 
	Запрос.УстановитьПараметр("СпособДоставки", ФильтрСпособДоставки); 
	Запрос.УстановитьПараметр("Склад", ФильтрСклад); 
	Запрос.УстановитьПараметр("ЗонаТариф", ФильтрЗонаТариф); 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Заказ
	|ПОМЕСТИТЬ СвободныеЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.Заказы КАК ЗаказыВРаботе
	|		ПО (ЗаказыВРаботе.Заказ = ЗаказПокупателя.Ссылка)
	|			И (ЗаказыВРаботе.Ссылка.Проведен)
	|ГДЕ
	|	ЗаказыВРаботе.Заказ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасходнаяНакладная.Ссылка) КАК КоличествоРН,
	|	МАКСИМУМ(РасходнаяНакладная.Ссылка) КАК РасходнаяНакладная
	|ПОМЕСТИТЬ ЗаказыСРасходными
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|		ПО (РасходнаяНакладная.Заказ = ЗаказПокупателя.Ссылка)
	|			И (РасходнаяНакладная.Проведен)
	|ГДЕ
	|	(ЗаказПокупателя.Ссылка В
	|				(ВЫБРАТЬ
	|					СвободныеЗаказы.Заказ
	|				ИЗ
	|					СвободныеЗаказы)
	|			ИЛИ ЗаказПокупателя.Ссылка В (&Заказы)
	|			ИЛИ ЗаказПокупателя.Ссылка В (&ЗаказыСохраненные))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.Ссылка В (&Заказы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПринятьВРаботу,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.Ссылка В (&ЗаказыСохраненные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Сохранен,
	|	ЗаказПокупателя.АдресДоставки,
	|	ЗаказПокупателя.ВремяДоставкиС,
	|	ЗаказПокупателя.ВремяДоставкиПо,
	|	ЗаказПокупателя.Вес,
	|	ЗаказПокупателя.Объем,
	|	ЗаказПокупателя.Организация.Префикс КАК Префикс,
	|	ЗаказПокупателя.ОжидаемаяДатаВручения КАК ДатаДоставки,
	|	ВЫБОР
	|		КОГДА ЗаказыСРасходными.КоличествоРН > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Отгружен,
	|	ВЫБОР
	|		КОГДА ЗаказыСРасходными.КоличествоРН = 1
	|			ТОГДА ЗаказыСРасходными.РасходнаяНакладная
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|	КОНЕЦ КАК РасходнаяНакладная
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыСРасходными КАК ЗаказыСРасходными
	|		ПО ЗаказПокупателя.Ссылка = ЗаказыСРасходными.Заказ
	|ГДЕ
	|	(ЗаказПокупателя.Ссылка В
	|					(ВЫБРАТЬ
	|						СвободныеЗаказы.Заказ
	|					ИЗ
	|						СвободныеЗаказы)
	|				И ЗаказПокупателя.Проведен
	|				И (ЗаказПокупателя.ВидЗаказа = &ВидЗаказа
	|					ИЛИ &ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказовПокупателей.ПустаяСсылка))
	|				И ((ЗаказПокупателя.ВидЗаказа, ЗаказПокупателя.СостояниеЗаказа) В
	|						(ВЫБРАТЬ
	|							Справочник.ВидыЗаказовПокупателей.Ссылка,
	|							Справочник.ВидыЗаказовПокупателей.СостояниеОжидаетОтгрузки
	|						ИЗ
	|							Справочник.ВидыЗаказовПокупателей
	|						ГДЕ
	|							НЕ Справочник.ВидыЗаказовПокупателей.ПометкаУдаления
	|							И НЕ Справочник.ВидыЗаказовПокупателей.НеИспользоватьДоставку)
	|					ИЛИ ЗаказПокупателя.ВидЗаказа = ЗНАЧЕНИЕ(Справочник.ВидыЗаказовПокупателей.ПустаяСсылка))
	|				И (ЗаказПокупателя.СлужбаДоставки = &СлужбаДоставки
	|					ИЛИ &СлужбаДоставки = ЗНАЧЕНИЕ(Справочник.СлужбыДоставки.ПустаяСсылка))
	|				И (ЗаказПокупателя.Курьер = &Курьер
	|					ИЛИ &Курьер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|				И (ЗаказПокупателя.ОжидаемаяДатаВручения = &ДатаДоставки
	|					ИЛИ &ДатаДоставки = ДАТАВРЕМЯ(1, 1, 1))
	|				И (ЗаказПокупателя.Организация = &Организация
	|					ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|				И (ЗаказПокупателя.СтруктурнаяЕдиницаРезерв = &Склад
	|					ИЛИ &Склад = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|				И (ЗаказПокупателя.ЗонаТариф = &ЗонаТариф
	|					ИЛИ &ЗонаТариф = ЗНАЧЕНИЕ(Справочник.ЗоныТарифыДоставки.ПустаяСсылка))
	|				И (ЗаказПокупателя.СпособДоставки = &СпособДоставки
	|					ИЛИ &СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка))
	|				И (ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПунктВыдачи)
	|					ИЛИ ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Курьер)
	|					ИЛИ ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Почта))
	|			ИЛИ ЗаказПокупателя.Ссылка В (&Заказы)
	|			ИЛИ ЗаказПокупателя.Ссылка В (&ЗаказыСохраненные))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПринятьВРаботу УБЫВ,
	|	ЗаказПокупателя.ВремяДоставкиС,
	|	ЗаказПокупателя.Номер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДокументыДляПолученияПредставлений = Новый Массив;
	Заказы.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Заказы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	    Если ПредставленияДокументов.Получить(Выборка.Заказ)=Неопределено Тогда
			ДокументыДляПолученияПредставлений.Добавить(Выборка.Заказ);
		КонецЕсли; 
	    Если ЗначениеЗаполнено(Выборка.РасходнаяНакладная) И ПредставленияДокументов.Получить(Выборка.РасходнаяНакладная)=Неопределено Тогда
			ДокументыДляПолученияПредставлений.Добавить(Выборка.РасходнаяНакладная);
		КонецЕсли; 
	КонецЦикла;
	Если ДокументыДляПолученияПредставлений.Количество()>0 Тогда
		ДополнитьПредставления(ДокументыДляПолученияПредставлений);
	КонецЕсли;
	Для каждого СтрокаТабличнойЧасти Из Заказы Цикл
		СтрокаТабличнойЧасти.ПредставлениеЗаказа = ПредставленияДокументов.Получить(СтрокаТабличнойЧасти.Заказ);
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.РасходнаяНакладная) Тогда
			СтрокаТабличнойЧасти.ПредставлениеРасходнойНакладной = ПредставленияДокументов.Получить(СтрокаТабличнойЧасти.РасходнаяНакладная);
		КонецЕсли; 
	КонецЦикла; 
	
	ОбновитьОбъемИВес(Заказы, ВесВсего, ОбъемВсего);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПредставления(ДокументыДляПолученияПредставлений)
	
	Соответсвие = Новый Соответствие(ПредставленияДокументов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", ДокументыДляПолученияПредставлений);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Дата
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В(&Ссылки)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Представление = СтрШаблон(
		НСтр("ka='%2-ის #%1';ru='№%1 от %2'"),
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина),
		Формат(Выборка.Дата, "ДЛФ=D"));
		Соответсвие.Вставить(Выборка.Ссылка, Представление);
	КонецЦикла; 
	
	ПредставленияДокументов = Новый ФиксированноеСоответствие(Соответсвие);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФильтров()
	
	ЗаголовокГруппы = "";
	Если ЗначениеЗаполнено(ФильтрСлужбаДоставки) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрСлужбаДоставки);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ФильтрКурьер) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрКурьер);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ФильтрСпособДоставки) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрСпособДоставки);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ФильтрЗонаТариф) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрЗонаТариф);
	КонецЕсли;
	Если ЗначениеЗаполнено(ФильтрДатаДоставки) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+НСтр("ru='доставка ';ka='доставка '")+Формат(ФильтрДатаДоставки, "ДЛФ=D");
	КонецЕсли;
	Если ЗначениеЗаполнено(ФильтрОрганизация) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрОрганизация);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ФильтрСклад) Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрСклад);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ФильтрВидЗаказа) И ФормаПараметры.НесколькоВидовЗаказов Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(ФильтрВидЗаказа);
	КонецЕсли; 
	Если ЗначениеЗаполнено(СостояниеЗаказов) И НЕ ФормаПараметры.НесколькоВидовЗаказов Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+Строка(СостояниеЗаказов);
	КонецЕсли;
	Если ФормаПараметры.НесколькоВидовЗаказов Тогда
		ЗаголовокГруппы = ЗаголовокГруппы+?(ПустаяСтрока(ЗаголовокГруппы), "", ", ")+НСтр("ka='только готовые к отгрузке';ru='только готовые к отгрузке'");
	КонецЕсли; 
	
	Если ПустаяСтрока(ЗаголовокГруппы) Тогда
		Элементы.ГруппаФильтры.ЗаголовокСвернутогоОтображения = НСтр("ka='ფილტრები';ru='Фильтры'");
	Иначе
		Элементы.ГруппаФильтры.ЗаголовокСвернутогоОтображения = НСтр("ru='Фильтры: ';ka='Фильтры: '")+ЗаголовокГруппы;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСклада()
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) И ФормаПараметры.НесколькоСкладов Тогда
		Объект.Склад = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ОсновнойСклад");
		Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
			Объект.Склад = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;
		КонецЕсли; 
		ФильтрСклад = Объект.Склад;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Если ФормаПараметры.НесколькоСкладов Тогда
		Запрос.УстановитьПараметр("Ссылка", Объект.Склад);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Представление,
		|	СтруктурныеЕдиницыКонтактнаяИнформация.ЗначенияПолей
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы.КонтактнаяИнформация КАК СтруктурныеЕдиницыКонтактнаяИнформация
		|ГДЕ
		|	СтруктурныеЕдиницыКонтактнаяИнформация.Ссылка = &Ссылка
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И СтруктурныеЕдиницыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы)";
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Объект.Организация);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОрганизацииКонтактнаяИнформация.Представление,
		|	ОрганизацииКонтактнаяИнформация.ЗначенияПолей
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка = &Ссылка
		|	И ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации)";
	КонецЕсли; 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.АдресОтправки = Выборка.Представление;
		Объект.АдресОтправкиЗначенияПолей = Выборка.ЗначенияПолей;
	Иначе
		Объект.АдресОтправки = "";
		Объект.АдресОтправкиЗначенияПолей = "";
	КонецЕсли;
	
	ОбновитьАдресОтправкиНаФорме();
	
КонецПроцедуры

&НаСервере
Функция СостояниеОжидаетОтгрузки(Заказ, Отказ)
	
	Если ФормаПараметры.НесколькоВидовЗаказов Тогда
		ВидЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ВидЗаказа");
	Иначе
		ВидЗаказа = Справочники.ВидыЗаказовПокупателей.Основной;
	КонецЕсли;
	СостояниеЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЗаказа, "СостояниеОжидаетОтгрузки");
	
	Если НЕ ЗначениеЗаполнено(СостояниеЗаказа) Тогда
		Если ФормаПараметры.НесколькоВидовЗаказов Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(НСтр("ka='Не задано состояние готовых к отгрузке заказов для вида %1';ru='Не задано состояние готовых к отгрузке заказов для вида %1'"),
			ВидЗаказа),
			ВидЗаказа,
			"СостояниеОжидаетОтгрузки",,
			Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ka='Не задано состояние готовых к отгрузке заказов';ru='Не задано состояние готовых к отгрузке заказов'"),
			ВидЗаказа,
			"СостояниеОжидаетОтгрузки",,
			Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СостояниеЗаказа;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	Если КомандыПечатиМассиваОбъектов.НайтиПоЗначению(Команда.Имя)=Неопределено Тогда
		УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, МассивРасходныхНакладных());
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция МассивРасходныхНакладных()
	
	МассивЗаказов = Новый Массив;
	Для каждого Стр Из Заказы Цикл
		Если НЕ Стр.ПринятьВРаботу Тогда
			Продолжить;
		КонецЕсли; 
		МассивЗаказов.Добавить(Стр.Заказ);
	КонецЦикла; 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказы", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Заказ В
	|			(&Заказы)
	|	И РасходнаяНакладная.Проведен";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКомандыПечатиПоМассивуОбъектов(КомандыПечати)
	
	Для каждого Стр Из КомандыПечати Цикл
		Если НЕ ПустаяСтрока(Стр.Обработчик) Тогда
			КомандыПечатиМассиваОбъектов.Добавить(Стр.ИмяКомандыНаФорме);
		КонецЕсли; 
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти
